// 1 задание
// Создать переменные num1, num2 которые пользователь вводит с клавиатуры
// Проверьте, что переменная num1 равна или меньше 1, а переменная num2 больше или равна 3.

let num1 = +prompt("Введите первое число");
let num2 = +prompt("Введите второе число");
// не совсем поняла, что делать, если "да"
if(num1 <= 1) {
  alert(`${num1} меньше или равно 1`)
} else if(num2 >= 3) {
  aklert(`${num2} больше или равно 3`)
}

// 2 задание
// Перепишите код к тернарному оператору

// let test = true;
// if (test === true) {
// console.log('+++');
// } else {
// console.log('---');
// }

let test = true;
console.log((test === true ? '+++' : '---'));

// 3 задание
// В переменной day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).

let day = +prompt("Введите число месяца от 1 до 31");

if(day < 1 && day > 31) {
  alert("Вы ввели невенрое число")
} else {
  if (day >= 1 && day <= 31) {
    if(day >= 1 && day <= 10) {
      alert(`${day} отосится к первой декаде`)
    } else if(day >= 11 && day <= 20) {
      alert(`${day} отосится ко второй декаде`)
    } else {
      alert(`${day} отосится к третьей декаде`)
    }
  }
}
